{
    "username": "ebitlew",
    "following": "10",
    "followers": "5.3m",
    "num_of_posts": "1,415",
    "profile_description": "Ebit Lew\nPublic Figure\nJemputan Training Seminar hubungi 0389267020\nyoutu.be/UbCLxuTLLUY",
    "profile_image_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-19/s150x150/12063269_768053143318047_1945701778_a.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_ohc=6ej-Owrkj0YAX_oLJBQ&tn=7tNOndm0j_bx6jdM&edm=ABfd0MgBAAAA&ccb=7-4&oh=89a922be40db23f1a4ab56783602e493&oe=60F94C14&_nc_sid=7bff83",
    "posts": [
        {
            "likes_num": "212,420",
            "description": "Sedih sayu terharu sangat rasa bila dapat surat takziah dari Kementerian Luar Palestin. Walau sekejap misi kemanusiaan di Gaza. Terima kasih tak terhingga pada Dr Mahmoud El Mahdoun dan Kementerian Luar Palestin. Terharu bila tiba-tiba dapat panggilan takziah dari pemimpin Palestin. Katanya Allah balas segala pengorbanan ustaz sanggup berjauhan dengan ayah demi Palestin. Allahuakbar.\n\nAllah pasti akan bantu bebasnya Palestin dan janjinya itu benar. Pasti dan waktu yang dekat hari kemenangan itu tiba. Tiada lagi penganiayaan dan kezaliman israel atas orang Palestin. Ya Allah berilah bantuan dan kemenanganMu pada kami. Bantulah penduduk Palestin.\n\nTerharu sangat bila pemimpin disana siap datang bilik saya berbual-bual. Berbincang tentang betapa pentingnya setiap orang bersama dalam perjuangan ini. Lagi terharu tanpa minta dianugerahkan Duta Muhibbah Palestin. Sedangkan saya bukan sesiapa. Katanya setiap orang berharga dalam perjuangan ini. InsyaAllah berjanji akan menjayakan menyempurnakan galeri ilmu bagi remaja Palestin dimasa akan datang. Supaya usaha israel ingin menghapuskan keturunan mereka dan identiti mereka serta terlupa kampung halaman mereka sendiri- ebitlew",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/218122892_339628187656936_6240337831844371831_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=1&_nc_ohc=8MPZ-IbfFpAAX8qpdU-&edm=AABBvjUBAAAA&ccb=7-4&oh=ca0056452622b0d55b3a50a279f74ec0&oe=60FAB203&_nc_sid=83d603"
        },
        {
            "likes_num": "723,491",
            "description": "Innalillahi wa inna ilaihi rajiun. Bapak saya yang tercinta baru sahaja meninggal dunia. Ya Allah beratnya rasa ujian ini. I love you bapak. Bapak pergi dulu. Nanti ebit sampai yer. Ya Allah ampunilah bapak. Sayangilah beliau, rahmatilah beliau,hadiahkan syurga Firdaus untuk beliau. Ya Allah temukanlah bapak dengan mak dekat sana. Letakkanlah mereka bersama. Ya Allah,inilah ayahku yang sangat baik. Terima kasih pinjamkan dirinya untukku.\n\nSaya dalam perjalanan ke Gleanagle Hospital untuk bawa jenazah ayah untuk dimandikan di Masjid Bandar Baru Ampang. Kemudian terus bawa ke Muadzam Shah Pahang. Pohon doakan buat ayah saya dan hadiahkan AlFatihah..",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/217604552_549791789392836_7653862592163526863_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=1&_nc_ohc=dRiPqeUqDQ0AX947MfM&tn=7tNOndm0j_bx6jdM&edm=AABBvjUBAAAA&ccb=7-4&oh=6f5225b2a926ed0a6e3a05cedd840c11&oe=60F91A38&_nc_sid=83d603"
        }
    ]
}