{
    "username": "gretathunberg",
    "following": "1,109",
    "followers": "11.7m",
    "num_of_posts": "741",
    "profile_description": "Greta Thunberg\nClimate- and environmental activist with Asperger’s\nBorn at 375 ppm\nyou.wemove.eu/campaigns/the-eu-must-protect-forests-not-burn-them-for-energy",
    "profile_image_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-19/s150x150/139968094_113625987343278_1256866060972554908_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_ohc=mxBBSQ5T8EQAX8BnZzY&edm=ABfd0MgBAAAA&ccb=7-4&oh=242612c493762dc447d2507326ba2ea0&oe=60FA8584&_nc_sid=7bff83",
    "posts": [
        {
            "likes_num": "171,922",
            "description": "School strike week 152. This week on a clear cut in Sápmi. Today the EU present the #EUForestStrategy . They will continue to allow clear cutting, they will call burning forest biomass “renewable” - worsening the climate- and ecological emergencies and ignoring indigenous rights and demands.\n#schoolstrike4climate\n#MindTheGap\n#climatestrike\n#fridaysforfuture #FaceTheClimateEmergency #StopFakeRenewables",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/217844172_557816258558530_8292213711224867847_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=1&_nc_ohc=czMZQyhRt08AX_fXMq0&edm=AABBvjUBAAAA&ccb=7-4&oh=d48cfeb6d7076c2529b55bb4abd84ab6&oe=60F92C3D&_nc_sid=83d603"
        },
        {
            "likes_num": "188,892",
            "description": "This is Riehpovuotna/Repparfjord in the northern part of Sápmi, in Norway. The fjord is a protection area for the threatened Atlantic salmon. The Norwegian government has granted a permission to pump 2 million tons of toxic mining waste into the fjord annually.\n\nThis will impact the local fisheries that are essential to the Sea Sami culture and will be yet another attack on them from the norwegian state.\nThe mining company Nussir ASA has planned a mine in the mountain in the middle of reindeer guottetbáiki (where the calves are born), which therefore is crucial for the reindeer.\n\nThere is currently an activist camp at Riehpovuotna and many people are resisting.\n\nEven though we must combat the climate crisis, this cannot be used as an excuse for so-called “green” colonialism with the same mindset that got us in this mess in the first place. #iifalnussir #reddrepparfjord #reddfjordene #savethefjords\nCred: @reddrepparfjord",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/218050197_337377181220690_6839685664293796074_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=102&_nc_ohc=LsxrZJGOZ9MAX8H7Og7&edm=AABBvjUBAAAA&ccb=7-4&oh=bbf4406566fe53876fce4d63d218ef93&oe=60FA364F&_nc_sid=83d603"
        },
        {
            "likes_num": "156,973",
            "description": "School strike week 151. This Friday we are in a tree plantation in Sápmi, in Northern Europe. This used to be a forest, but after it was cut down forest companies have planted an invasive tree species that grows quicker than the local ones. Cutting down forests - at a time when we need to maximise every possible carbon sink - is not only disastrous for the climate, but also for biodiversity. Not to mention the local indigenous Sami reindeer herders who have lived here and cared for this land for thousands of years. When humans now change and destroy the landscape, they also completely alter the living conditions for the local wildlife, as well as for the reindeer and humans living there. It is not just the forests and carbon sinks that are being eliminated, but also the history, future and traditions of the Sami people.\nForests are not renewable, whatever the industries may say. Trees are renewable, but not forests. In a short term we only switch from one source of carbon to another when we burn biomass. Since we don’t have the time it takes for the clear cut to compensate for the carbon debt (to stay below 1,5°C of global heating) it should not be considered “climate neutral”.\nAmid the climate crisis and more frequent and intense extreme weather events (such as heatwaves, floods and wildfires) - these plantations also exacerbate their effects, increasing the devastation and suffering of people and wildlife.\nThe indigenous Sami people have been historically systematically oppressed, and still are so today. Indigenous peoples make up 5% of the world’s population, but take care of 80% of the remaining healthy ecosystems. They are almost always on the frontline of the climate- and ecological crisis, but they are also leading the resistance. We have to listen to the guardians of the land and value their traditional knowledge to get out of this global crisis. The exploitation of nature, land and people needs to stop.\n#schoolstrike4climate\n#climatestrike\n#fridaysforfuture #IndigenousRights #StopFakeRenewables",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/212674686_810650736286588_7686896478437049080_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=104&_nc_ohc=P2o9mdjc2UgAX_uShM9&edm=AABBvjUBAAAA&ccb=7-4&oh=9fe82866909c2042e412f7379d03d1ea&oe=60F9FE4F&_nc_sid=83d603"
        },
        {
            "likes_num": "593,542",
            "description": "The last week I’ve been hiking in Sápmi, during the extreme heatwave in northern Scandinavia. We had 32°C 200km above the Arctic circle. 34,3°C was recorded in Banak, Norway, the highest temperature ever measured above 70N in Europe.",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/211444294_172688421583211_6853215194809441742_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=111&_nc_ohc=yyXnjOyExqgAX-9N7RC&edm=AABBvjUBAAAA&ccb=7-4&oh=d58cf874ffcad1c5a0e0dca768431d53&oe=60FA0D1F&_nc_sid=83d603"
        },
        {
            "likes_num": "132,092",
            "description": "School strike week 150. Even though it’s summer holiday we keep on protesting on Fridays.\n#schoolstrike4climate\n#MindTheGap\n#climatestrike\n#fridaysforfuture #FaceTheClimateEmergency",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/209349279_136055951933374_6840605611502540924_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=110&_nc_ohc=GoMDFFsI84kAX__XfL3&tn=7tNOndm0j_bx6jdM&edm=AABBvjUBAAAA&ccb=7-4&oh=5c461b72f5650dc9b8b2974727d909ad&oe=60F8FB66&_nc_sid=83d603"
        },
        {
            "likes_num": "218,049",
            "description": "In 2 days the Canadian temperature record has gone from 45°C ( from 1937) to 47.9°C. Highest temperature ever recorded in the planet north of 50N latitude also shattered (44.4C from July 1941)\nHeat records are usually broken by decimals, like a tenth of a degree. And not in June...\n\nWe're destabilizing the planet. Meanwhile our leaders continue to destroy present and future living conditions - opening new pipelines, oilfields and investing fantasy amounts into fossil fuel infrastructure, despite all the beautiful words.\n#MindTheGap between words and action.\nHeatwaves can be dangerous, especially if you are not used to it. Stay safe.\n#FaceTheClimateEmergency\nPicture from @scottduncanwx",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/209049724_1541438052914944_2524452470225402493_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=104&_nc_ohc=p12F3aupCv0AX-3MFKL&edm=AABBvjUBAAAA&ccb=7-4&oh=f983f97965d93c1e55a394737080db0c&oe=60F98A64&_nc_sid=83d603"
        },
        {
            "likes_num": "224,587",
            "description": "När det blir min tur kommer jag kavla upp eftersom varje kris måste behandlas som en kris.\n\nThe distribution of vaccines around the world is extremely unfair. 85% of vaccine shots have been given in high- and upper-middle-income countries. Only 0,3% have been given in low income countries, according to New York Times.\nBut this imbalance can only be solved by countries, cooperations and institutions - not individuals. So whenever your region is offering you a vaccine shot, please take it. I will roll up my sleeve when it’s my turn because we must listen to the science and treat every crisis like a crisis. No one is safe until everyone is safe. #kavlaupp #vaccineeqity",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/209105884_102118828770638_6549096083733437058_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=102&_nc_ohc=DT8LpYh1G7YAX-c3NT9&edm=AABBvjUBAAAA&ccb=7-4&oh=d4208c137e41028e19c9f48bf37e4ce8&oe=60FA1223&_nc_sid=83d603"
        },
        {
            "likes_num": "405,307",
            "description": "Nothing to see here... just some Swedes doing our annual midsummer-little-frogs-dance on the climate strike outside the Parliament. Happy midsummer everyone!\n#FridaysForFuture",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/204941014_938920993629746_7439443086805989698_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=102&_nc_ohc=SLv2ki7k80sAX_1jyJx&edm=AABBvjUBAAAA&ccb=7-4&oh=19c5e7d47630beefbe83b337c4fd9740&oe=60F55ED2&_nc_sid=83d603"
        }
    ]
}