{
    "username": "humansofny",
    "following": "240",
    "followers": "11.2m",
    "num_of_posts": "5,385",
    "profile_description": "Humans of New York\nNew York City, one story at a time. Created by Brandon Stanton. ‘Humans’ in bookstores everywhere. Click below to help Esther:\nbit.ly/letshelpesther",
    "profile_image_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-19/s150x150/118982623_353024589077161_7490638455124782637_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_ohc=bjLT1u9SoFEAX8PyT7w&edm=ABfd0MgBAAAA&ccb=7-4&oh=3013d0245dde80f4f2c0d01210f6afff&oe=610C4C60&_nc_sid=7bff83",
    "posts": [
        {
            "likes_num": "208,716",
            "description": "Last night I caught Esther on FaceTime just as she was switching trains on the way to work. For the first minute of the call, she just giggled. But then she grew quiet and tried to express her thoughts: ‘I’ve never had so many compliments,’ she said. ‘All of them were meaningful, but to read from moms, telling me: You deserve this— you did the right thing.’ I had to wear my sunglasses on the train. Because for so long I’d felt guilty. That maybe I should have worked more. A few months ago I was cleaning a lady’s house, and I asked if I could leave a little early-- because my daughter was coming home from college that day.  But the lady didn’t like that. She thinks maybe I just don’t want to work. And it made me feel so guilty. It’s not that I’m afraid of work. I’ve been working since I was thirteen. But after my daughters were born, I wanted to work less. So I could be there when they came home at 4 PM. I thought it was more important than to make another $20 or $50. Sometimes it hurt us. Sometimes we needed things, and I didn’t have it. But I didn’t want them to be alone. So to read the comments, from other moms, saying: ‘They needed you there. You did the right thing.’ I needed to read that. And thank you so much to everyone who gave. Now I can have a retirement plan. And most people I know— my older sisters— they don’t have these things. They are tired, and sick, but they keep working. And that’s OK. But in a way, it’s not. Because they all have a story like mine. We’ve all been working since we were very young. But I don’t have to do that anymore. I don’t have to work until I can’t. I can take some time. With my daughters especially. They’re not as young anymore, but still, we can do things together. I can take them places. And not just to a park anymore. But to dinner-- and restaurants. I can enjoy, and not feel guilty. So thank you. I’m also going to take time for myself now. I’m going to get my GED. It will be hard, because of the math. Even in sixth grade I hated math. But I’m going to do it. So thank you to everyone. To the people who gave so much. And also to the people who gave just a little, because it grew into something very big for me.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/227663052_226839765976937_7580246003466933072_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=105&_nc_ohc=fQr6oNZ9KQ0AX_5tXOj&edm=AABBvjUBAAAA&ccb=7-4&oh=43a401fe3d86d0b53d57732d18a586fa&oe=610BE8E6&_nc_sid=83d603"
        },
        {
            "likes_num": "269,173",
            "description": "(2/2) “The only photo I have from childhood is from my sixth-grade report card. It was the same year my mother told me I had to leave school. I moved to Mexico City and began working as a housekeeper for a rich family. They had a daughter who was the same age as me. And I felt so envious of her. She had her own bedroom. She had so many nice things. She went to the concerts of famous singers. But most importantly, she was going to school. When I was fifteen I came to America. I started working in the home of a young couple. It was near a high school, and it hurt me every morning. Seeing all those teenagers going to school. When my daughters were born, I said: ‘They’re going to college, no matter what.’ I started reading little books to them every night. My English wasn’t good, but I knew they wouldn’t judge me. But after third grade it became very hard for me to help them. Especially in math. But I kept pushing them. I told them my story. How I’d been all alone in life. How I never had this opportunity—to go to school. I always said to them, in Spanish: ‘Tu exito es mi exito.’ Your success is my success. I don’t know why they worked so hard. Maybe because we didn’t have anything. Other classmates had their mother, father, car, house. But we had nothing. Just me. There were days I couldn’t pay the $20 for their school trips. I could have taken extra work: more days, more hours. But I wanted to be there when they got home. I wanted to talk to them. To cook them a healthy breakfast in the morning. I wanted them to at least have me. Some of my family members were pushing me to work more. Maybe I seemed lazy to them. For wanting to spend time with my daughters. Back then I didn’t even have the strength to defend myself. But maybe now they see. When my daughters graduated, I wish I could have done more. I put up some decorations at home. But I wish I could have done more, like the other parents. Maybe give them a car. Or take them somewhere nice. I’m not allowed to leave the country, but I’d love to take them somewhere. Maybe Connecticut. Or Pennsylvania. Just a surprise of some sort. Telling them, I’m thankful for them. For giving me this gift. Tu exito es mi exito.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/225095910_510996949968239_619435764928435400_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=111&_nc_ohc=NGHkmfeYkEMAX-ODPIg&tn=iE3EjXAeSbdFAVDr&edm=AABBvjUBAAAA&ccb=7-4&oh=84b1509249ee9957158539825dae0061&oe=610BD704&_nc_sid=83d603"
        },
        {
            "likes_num": "311,003",
            "description": "(1/2) “We were in a shelter for a few months. My sisters weren’t old enough to remember, but I was five. So I still have memories. But one thing I don’t remember is my mother ever getting emotional. The only time she’d cry is when we were praying in church. We’d all be huddled together, praying for the same thing. It’s the only thing I’ve ever asked of God: for our family to be together again. Dad got deported when I was twelve or thirteen. After that my mom had to start working much more. She took extra housekeeping jobs on the weekend. And I’m still not sure how she did it, because I don’t remember her being absent from important things. She was the one pushing me and my sisters to do more and more. She’d sign us up for music class at the community center. And swimming lessons. She was the one who pushed us to join the debate team. She could never make it to the actual debating, but she’d come in the evening for the awards ceremony. She was at every single parent-teacher meeting. Our teachers would joke: ‘You don’t have to be here. You know what we’re going to say.’ But I think she just needed to be reassured-- that we were doing great. There was so much she couldn’t give us: concert tickets, new clothes. She at least needed to know that she was being a good mother. I went on to graduate from Wesleyan. My other sister from Yale. And my youngest sister is at Stanford right now. I think when my mom looks at us, she sees her own potential. She left school in sixth grade to work on her family’s farm. She’s low income. Undocumented. For her entire life she’s been so limited. I’m working at a nonprofit right now. And it’s not a ton of money, so I’m still living at home. My mom wakes up earlier than I do. She comes home later. She works harder for less money. And she doesn’t have real health insurance. The other day I was at a staff retreat. We were sitting on a rooftop, drinking wine. And I couldn’t help but think about my mom. She’s never been to a rooftop. There’s a whole other side of this city that she’s never seen. A whole other side of life. It’s a side she would have known if she’d been able to navigate the world. And it’s a side I hope to show her one day.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/224888290_1542202592781597_9223300323959876647_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=109&_nc_ohc=a6pTWk25d1oAX9DQCJY&edm=AABBvjUBAAAA&ccb=7-4&oh=dae9aeed798cdf1f4ad2870bffee1096&oe=610CDCBD&_nc_sid=83d603"
        },
        {
            "likes_num": "210,690",
            "description": "After our first meeting Saroj gifted me an antique Bible. She then revealed that most of her own prayers were directed to Durga Maa, the ‘Goddess of Energy.’ I would later learn that Durga Maa’s cosmic arsenal includes ‘strength,’ ‘protection,’ and ‘motherhood.’ Since I’m a big believer in all those things, Durga Maa definitely seemed like a deity I could get behind. Over the next few weeks she became a thing between me and Saroj. We pasted Durga Maa animations into our text threads. Saroj sent my daughter a Durga Maa birthday card. And whenever we hit a snag in our negotiations with her landlord, it was: ‘Nothing to worry about. Durga Maa is on the move.’ Right before the fundraiser got posted, Saroj was a nervous wreck. We weren’t sure that we could raise the full amount to settle her debts. But even if we did, it would mean closing an important chapter in her life. Saroj had put her heart and soul into The Dress Shoppe for forty years. It represented community to her. It represented income during her old age. And it also represented her husband’s legacy. Saroj’s breast cancer would no longer allow her to shoulder the stress of a business. Still—it would be extremely hard to let go. ‘But Durga Maa sent you here,’ she said. ‘So I will go with her.’ As of this moment the fundraiser is over $430,000. I was too shy to ask everyone for more than the $130,000 needed to cover Saroj’s debts, because it was already such a high amount. I was nervous about us getting there. But Durga Maa knew Saroj needed much more. And Durga Maa moved quite forcefully. I wasn’t in New York when I posted the story, but @newyorknico went and sat with Saroj. When the fundraiser reached $25,000 in only a few minutes, I called to let Saroj know that it was going to be a success. I didn’t realize Nico was filming. But it made me smile when he sent me the video. Especially when I noticed Durga Maa dangling from a chain around Saroj’s neck. Thanks so much to everyone who contributed. And thanks to everyone who stopped by to visit The Dress Shoppe at 83 Second Avenue. Saroj has been sending me selfies all day. If you really squint your eyes, you can see Durga Maa smiling in each one.",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/222693135_499303464494353_7556046909115510539_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=101&_nc_ohc=GNfncQ9XXPEAX-6-43R&edm=AABBvjUBAAAA&ccb=7-4&oh=9c7f7fc1358cb30372e8cfea340f6358&oe=610B2DF2&_nc_sid=83d603"
        },
        {
            "likes_num": "291,926",
            "description": "“He always wanted me to dress like a queen. Whenever we went to a party, he’d say: ‘Put on your nicest sari. Or a little more jewelry’ And I’d tell him, ‘Oh Goyal, please shut up.’ But he loved clothes. It was his passion. Every piece of clothing in our store he chose himself. We’ve owned this business for forty years, and the entire time I was his helper. That’s just how things were in our generation. Now young women are working in India, but not during our time. So I’ve always been his helper. I was the shy one. Goyal was the one who approached the customers. Everyone loved him. You should see the things they wrote in his memorial book. Whenever people saw him, they were shining in the face. Because he always had a joke. One hundred jokes per minute. People would pull him on stage at parties, and say: ‘Please Goyal, make the jokes.’ He even made the nurses laugh at the hospital. During the months he was sick in bed, he still wanted me to dress for him. ‘Please Saroj,’ he’d say. ‘Just a little more jewelry.’ He fought for the longest time. I wanted to give him my kidney, but I wasn’t a match. He said: ‘I don’t want to die, Saroj. I don’t want.’ But on the last day he said: ‘Krishna is coming to take me.’ That was two years ago. And it’s been so hard for me with him gone. He’d do anything to make me laugh, but he never told me anything. Nothing about the accounting. Or how much we owed. Or the taxes. I still don’t understand the tax thing. I’m a little upset with him. Because he left me in this situation. I had to close down when the pandemic came. And when we opened our doors again, there was nobody: no cars, no nothing. I owe so much money now. I miss him so much. At home I’ve made an altar to him. When I take my bath, first I pray to him. He was everything to me. Everything. But I’m angry, I really am. I wish he’d have told me more. Because without him I can’t deal with this. My two children live far away. And I stay alone. Sometimes I feel like if something happens to me, nobody will know it. I put on a sari for this interview, and some lipstick. But it’s the first time in a long time. Because there’s nobody asking me to dress up anymore.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/220603858_1709612039226025_2895682507214166029_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=101&_nc_ohc=O6vzcBg8YFYAX-SS_FW&tn=iE3EjXAeSbdFAVDr&edm=AABBvjUBAAAA&ccb=7-4&oh=bfb06d30a238acbc5cdd5267970cfaae&oe=610B858F&_nc_sid=83d603"
        },
        {
            "likes_num": "230,150",
            "description": "“My mother wanted something conventional. And that wasn’t my father. So after the age of five we never lived with him. Sundays were our day together. He’d take us to the candy store, or the flea market, or to bumper cars on Coney Island. Then sometimes we’d go home and play ‘Alaska.’ Alaska was this crazy game we’d play in the middle of the winter. My dad would open up all the windows in his apartment, and we’d pretend we were in Alaska. He was always doing crazy things like that. But we had a very conventional mother and stepfather. So the way we saw it—we had the best of both worlds. Dad never held down a nine-to-five job, so he was always selling something. Or at least looking to make a trade. At restaurants he’d attempt to pay for our meal with jewelry. Or he’d try to talk our cab driver into accepting a bottle of perfume. He’d stop anyone on the street to sell them a scarf, or even just to talk. But his true passion has always been magic. He carries a deck of cards with him everywhere. And he’ll wrangle an audience wherever he can find one. He says: ‘Accadas, Nitram,’ which is his name backwards. Then he’ll pull a card out of the ear or mouth of anyone walking down the street. He’s extremely good. You can pick a random card, shuffle the deck, and he’ll pretend he can’t find it. Then he’ll pull it out of his wallet. One time he came to my third-grade class in a cape and hat, and did a magic show. I got to be the magician’s assistant, and we made three oranges disappear. The other kids couldn’t believe it. Brandi’s dad did magic! I was star of the day. Star of the year. When I had kids of my own, Pop Pop did a magic show for all of their classes. I insisted on it. Dad is eighty-five now. Maybe the correct card doesn’t always come out of the deck anymore, but he’s still magic. This Father’s Day we took him out to lunch. And as we were leaving the restaurant, I turned around and saw him at a stranger’s table. He was performing a trick for two young children, and they loved it of course. But for me it brought back a flood of memories. Of the thousands of people this man has made smile over the years.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/219122320_1509025852823081_7674358685376199228_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=105&_nc_ohc=6CQvGF2sZw0AX_kDrb4&edm=AABBvjUBAAAA&ccb=7-4&oh=b9d088da75c750749fcd834cd326f340&oe=610CC5F5&_nc_sid=83d603"
        },
        {
            "likes_num": "245,585",
            "description": "“The story of the black cowboy began when our ancestors were brought to this country against their will. Many of them were adept with horses. The first Kentucky Derbies were won by black jockeys. One out of four cowboys in The West were black. But you never see that in the movies. My father was a sharecropper. When I was a young boy he would put me on the back of a horse and direct me where to plow. Eventually I became so skilled that I tried my hand at the rodeo circuit. But I soon learned that a black cowboy could sit on a bull for half a day and still not win any prize money. I ended up getting a doctorate from St. Johns, and over the years I worked at several different universities. But I kept running into colleagues who didn’t believe there was such a thing as a black cowboy. And that wasn’t going to stand. So in 1984 I organized The Black World Championship Rodeo. Nobody thought it could be done. It was the first rodeo ever held in a US urban city. But I got all the permits. I covered all the expenses from my own pocket. We flew in all the best black cowboys from around the country, and we flew them first class. We held our first rodeo in Harlem’s Colonel Young Park. Colonel Charles Young was denied a generalship during World War I because he was black. He rode his horse all the way to Washington DC in protest. The protest wasn’t successful, but sixty years later 20,000 people filled Colonel Young Park for the world’s first Black Championship Rodeo. And that number doesn’t even include the people peering down from the high-rise apartments. The Black World Championship Rodeo came back to Harlem every year for the next thirty years. And it’s gonna do for me what the movies did for John Wayne. It’s going to leave me a legend. We opened every rodeo with the national anthem, and a black cowboy would ride out carrying the American flag. It always made me emotional. Because with all the hurdles that we’ve faced, and still face-- it’s amazing that we still love our country. But I do. Because it afforded me the opportunity to do what I did. And I delivered. I showed the whole world: there have always been black cowboys. And there always will be.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/220521846_420048579197527_6099815443409959036_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=107&_nc_ohc=ermDc23P-hwAX_HutDx&edm=AABBvjUBAAAA&ccb=7-4&oh=f809b6f3d0ee7c46e55a077c2810c490&oe=610C1B98&_nc_sid=83d603"
        },
        {
            "likes_num": "293,364",
            "description": "“People thought I was crazy to open a store. I had no business experience. I’d just gotten my PhD in chemistry. And there was a trade embargo with China, so there were no stores selling Chinese goods, even in Chinatown. But I was idealistic. I thought: ‘Maybe I can help connect our two countries. If I traded with China—just a little, maybe we would understand each other more.’ Technically it was smuggling. But the rules were very gray. And if you gave the Canadian border agent a little tip, nobody seemed to mind. I named the store ‘Pearl River,’ which is the biggest river in the Canton Province. I wanted to remind Chinese immigrants of their home. And I thought: ‘Nobody can hate a river.’ We stocked our shelves with products that many immigrants hadn’t seen for twenty years. These were products from their childhood: their favorite soy sauce, their favorite soap, their favorite tea. Word spread quickly in the community. Everything I put on the shelves was gone the next day. It was beginner’s luck. We were in the right place at the right time. This was the early seventies—the time of Vietnam. And American students were becoming anti-war, anti-establishment. I’d drive to the Harvard campus with boxes of Mao jackets and political posters, and all of them would be sold. The FBI interviewed me many times. They thought for sure I was a communist agent. They’d ask me: ‘Why else start a store like this?’ But I would tell them: ‘I just want people to learn more about China.’ Art is not the only way to understand other cultures. Business is major too. Maybe customer will pick up some tea off the shelf, and I will explain the history of tea in China. Or maybe customer will pick up this traditional cough medicine called Pei Pa Koa. It was invented hundreds of years ago. And it’s made of roots and loquat—a fruit only found in China. Maybe this will make the customer curious. Maybe they will leave with a question. And they will be inspired to learn more about China. This brings us closer together. And that’s why trade is such a big part of peace. Every product has a story. And every product is a chance for connection.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/211415381_522103545794789_1707087040654092742_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=105&_nc_ohc=18AJBvIz0foAX_a3Vg0&edm=AABBvjUBAAAA&ccb=7-4&oh=0bd30c08c0cd4a2c018d1d90512a27cc&oe=610CA4A9&_nc_sid=83d603"
        },
        {
            "likes_num": "245,025",
            "description": "“My best memories from childhood are going to work with him. He’d give me a little vase and let me make my own arrangements. Even though they were terrible, he’d always pretend like he sold them. I loved being part of his world. He’d take me to all the neighboring shops, and everyone knew him. Partly because he’s 6’6”. But also because people just love being around my dad. His energy is infectious. He built all of this himself. He never went to high school. Never took a business class. He just loves flowers. He’ll tell anyone who’ll listen: ‘I love this job. Every day I love this job.’ I guess I just assumed I’d grow up to be the same way. I’ve always been Bill’s daughter. I love to take risks, and connect with people. I thought I’d do something special too. But somewhere along the way I lost myself. I don’t know--why does any woman lose herself? When you’re a mom, and a wife, and a career woman, so much of your day is spent on everyone else. I hadn’t even visited my dad at his shop in over ten years. I’d see him at his house on the weekends, but I always had my kid with me. Or my husband. So I never had a chance to just ‘be a daughter.’ But last May I was given an assignment in graduate school: I could write a report on any industry, so I chose flowers. Because I knew it would give me an excuse to visit my dad. When I came to the store he was in a tough spot. He’d been forced to change locations because of the pandemic. But he’d made so many friends already. Time after time a person would walk in, and they’d have their own little thing between them. I visited right before Mother’s Day. It was his first in the new spot—so he was trying to decide how many flowers to order. It was very high stakes. He really needed the business, but you’d never know he was under so much pressure. He was having fun. My dad just makes decisions with his heart and worries about the details later. He’s always been that way, and it’s never failed him. On the train home I was lost in my thoughts. It was the best day I’d had in a long time. Being so close to him made me realize something: I was also that way once. And I can be that way again. Because I’ve always been Bill’s daughter.”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/212629675_178496670920207_1693343217799057164_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=111&_nc_ohc=HpuFeH9R_TcAX8udcxu&edm=AABBvjUBAAAA&ccb=7-4&oh=e11767ba6f8c9522a76937ccd13a759d&oe=610BD5D1&_nc_sid=83d603"
        },
        {
            "likes_num": "458,122",
            "description": "“My dad said we could do something special for my 6th birthday. ‘Anything you want,’ he told me. I think he thought I was going to say ‘ice cream.’ But I said I wanted to go to New York City, and two weeks later we were on a plane. We spent the morning of my birthday shopping at the American Girl store. Then we went to lunch at Balthazar. Afterward my dad wanted to stop by an old Irish bar called McSorley’s. He’s not a creepy alcoholic father or anything. He designs bars for a living, and he’s always looking for inspiration. It was early in the afternoon so the bar was pretty calm. My dad ordered a beer, and an old man came and sat down at our table. He looked very Irish: suspenders, loose pants, red face. And he was very, very kind. He showed us a few card tricks. He loved that my last name was O’Brien. He kept calling me a ‘real life Irish princess.’ At the end of our visit we took a photo together. And as he was leaving, he told me: ‘I’m Matty Maher. The owner of this bar. And I’ll be expecting to see you again on your 21st birthday.’ As soon as we got home, we mailed Matty the photo of us. My dad and I visited McSorley’s a few more times over the years— anytime we were in New York. I’d always send Matty a postcard in advance, to let him know we were coming. But after awhile I wasn’t a little kid anymore. The bouncer got less and less excited about letting me inside, so we stopped going. I didn’t see Matty for several years. But when my 21st birthday came around, my dad took me on one last trip to New York. I sent Matty a postcard to let him know we were coming, but I wasn’t sure he’d remember me. It was early afternoon when we walked in the bar. It was almost empty—just like it had been fifteen years before. Matty was nowhere to be seen. And I was coming down with strep throat, so I wanted to leave. But it was just like a movie. The doors swung open, and Matty came in like a ray of sunshine. He brought a plate of cupcakes over to our table. He showed me a framed photograph of the two of us—it had been hanging in his office all these years. And then he gave me a birthday card. Inside he had written: ‘I’ve finally met a woman who keeps her word.’”",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/210860376_326245882564866_8565128386287797967_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=106&_nc_ohc=6zrnzxUccnsAX9jXD3X&edm=AABBvjUBAAAA&ccb=7-4&oh=d8a0c43a0e6860b5f4414d266814f200&oe=610B5016&_nc_sid=83d603"
        }
    ]
}