{
    "username": "laurenjauregui",
    "following": "2,492",
    "followers": "8.9m",
    "num_of_posts": "1,571",
    "profile_description": "Lauren Jauregui\nArtist\nsinger/writer\nthinker/feeler\nmiami/la\namericana/cubana\ncancer/scorpio/virgo\nshe/her\nlight being having a human experience, like you\nhi💫\nsounditouttogether.org",
    "profile_image_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-19/s150x150/210848350_1510118829326339_4662302416278916520_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_ohc=I8NMz9kXD7gAX-ji9dD&edm=ABfd0MgBAAAA&ccb=7-4&oh=2cd4878d39e7775a0e29b6352a29842a&oe=60F8E3BE&_nc_sid=7bff83",
    "posts": [
        {
            "likes_num": "141,639",
            "description": "My heart is with all of the people in Cuba in this moment. The people deserve freedom from the dictatorship. The people deserve resources and freedom of speech and protest. Food, medicine, access!! I also want to point out that the US Embargo doesn’t help the situation in the slightest and that US intervention isn’t going to be the savior to this situation. It’s important to look at the situation with critical thought // Mi corazón está con la gente de Cuba en este momento. La gente merecen libertad de la dictadura. La gente merecen el derecho de libertad de expresión y protesta. Comida, medicina, acceso coño!! También quiero apuntar que el embargo de los Estados Unidos sobre Cuba no ayuda la situación y que la intervención de los Estados Unidos no es la solución que creen que es. Es importante observar lo que está pasando con una mente crítica. 🇨🇺CUBA LIBRE!! #PatriayVida #SOSCuba mandando amor y fuerza🇨🇺\n\nMy mother and my grandparents on both sides were born on the island. My fathers family in Havana and my mothers from Matanzas. I am very proud of the strong connection I have with my roots and my ancestors. They deserve to see through my eyes Cuba, finally, free🇨🇺 //\nMi mamá y mis abuelos por los dos lados nacieron en la isla. La familia de mi papá en La Habana y la familia de mi madre en Matanzas. Siento much orgullo de tener una conexión fuerte con mis raizes y ancestros. Merecen ver a través de mis ojos de donde están que Cuba, al fin, libre🇨🇺\n📷: @efeamerica",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/217390108_814615229192982_6835416844207833782_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=1&_nc_ohc=EamKUtnD97UAX_VSV2n&edm=AABBvjUBAAAA&ccb=7-4&oh=327ceb925a6fc7bf8167a168d39e863f&oe=60F99E02&_nc_sid=83d603"
        },
        {
            "likes_num": "212,705",
            "description": "Festivities cont.\nThere’s new music in the world every day\nI believe this whole project and all the talented women who were a part of it deserve a major listen so 10/10 recommend you take one #BigFemmeEnergy Volume 1\n\nSecond slide is a clip of my song While I’m Alive (prod. By @alberthype ) featured on the project. Um yeah, thankyouu 💞🥰🦋🌺",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/213246551_4045121228869861_649687731073597882_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=101&_nc_ohc=31PWbtkULIMAX-Gyj7o&tn=7tNOndm0j_bx6jdM&edm=AABBvjUBAAAA&ccb=7-4&oh=9c5f495bb82988bb17b6d42deb656908&oe=60F4C628&_nc_sid=83d603"
        },
        {
            "likes_num": "419,685",
            "description": "Yes I posted all the damn pictures\nYes you better take the time to scroll through em all👅\nHair & makeup by my baby @jillpowellglam styling by @jasibenjamin 🥰\n#BigFemmeEnergy indeed! Thank you @femmeitforward & @heatherlowery for having me be a part of this incredible project🌺 I had such a beautiful night, imma keep spamming you lol #WhileImAlive is out now and available for streaming!!",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/p1080x1080/212685286_194216465875020_1534527112782939179_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=1&_nc_ohc=pYlQivpSOUEAX8CD09a&tn=7tNOndm0j_bx6jdM&edm=AABBvjUBAAAA&ccb=7-4&oh=3dcaae0af54ed89545cd5c64fb09fbc6&oe=60F90D76&_nc_sid=83d603"
        },
        {
            "likes_num": "124,842",
            "description": "So grateful to be a part of this beautiful piece of art. Songs by women who are so deeply connected with their craft and truth. I feel deeply that when we women share our truths— with ourselves, one another, and especially together—we heal. Thank you to all of the incredible women & folks who came together to create this visually and sonically✨ Im honored to be a part of your beautiful vision @heatherlowery . This song was one I wasn’t sure the world was ever gonna hear. It’s quite personal and was written from a vulnerable place of being completely tired of being told who the fuck I am and who I’m supposed to be in order to be successful in this industry. It was written to someone, but at the end of it, like most of my songs, it was really just about me and making sure I was reminded of the power of my vulnerability and truth, no matter what anyone has to say about it in this judgmental ass world. I hope it empowers you to feel seen. #BigFemmeEnergy @FemmeItForward",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/212561713_487041372396008_3294835762493795858_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=108&_nc_ohc=ZNJIwsPuzEoAX9AlM8J&edm=AABBvjUBAAAA&ccb=7-4&oh=20e81b4798b1239f6b5713287a1762f5&oe=60FA8AD0&_nc_sid=83d603"
        },
        {
            "likes_num": "324,642",
            "description": "#BigFemmeEnergy",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/p1080x1080/210214124_334598898160207_3801824912264712040_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=107&_nc_ohc=_oSkwrfOmw4AX9ks4Db&edm=AABBvjUBAAAA&ccb=7-4&oh=f368867c733b96a9672384ce8f1e3869&oe=60F8E168&_nc_sid=83d603"
        },
        {
            "likes_num": "426,381",
            "description": "I love rain showers.. thunderstorms...seeing the lightening move so quickly and violently and beautifully through the sky. I don’t know why but they’ve always made me feel calm, even when the thunder was particularly upset. The sound of rain hitting the things we’ve made, yes, while I sit at home or in a car seat and watch it through the window panes between us. It was one of the reasons I couldn’t see myself living in California forever. It never rains. I need the rain. They tell us to stay out of it, that it ruins a sunny day but one thing about Miami is it’s gonna have its aguaseros and it’s descansos. Quince minutos si lo puedes soportar..and I prefer to wait it out in the water. On my birthday this year, the sun made a glorious appearance and kept me warm and the water refreshing..but the rain also stopped by to say hello and wish me a new year of life...offering me it’s cleansing. Fresh meeting salt..floating in the vast expansiveness that is Yemaya’s waters. It felt right. I feel most alive here. I feel held here..by the buoyancy of the water..by the spirits of my grandmothers and their mothers mothers. The water, in all its forms, reminds me we all belong to something greater and feeling it’s caress will always feel like home.\n\n((tell me you’re a water sign without telling me you’re a water sign))",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/s1080x1080/209438769_130849799163328_6138907628874780284_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=104&_nc_ohc=iaSFVuU63vAAX8Ml6aF&tn=7tNOndm0j_bx6jdM&edm=AABBvjUBAAAA&ccb=7-4&oh=6ea6b4825adac2bb2ecc033959fce495&oe=60FA9A0E&_nc_sid=83d603"
        },
        {
            "likes_num": "635,130",
            "description": "Thank youu to everyone who helped organize this beautiful trip with beautiful people✨💞 @naplesgranderesort",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/p1080x1080/209217051_345126420511850_3947533800571242159_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=102&_nc_ohc=HzfIm6_s5-gAX9AA3Gq&edm=AABBvjUBAAAA&ccb=7-4&oh=1d0ddc9071e12b6c4b1ae101a68a395b&oe=60F8CA6F&_nc_sid=83d603"
        },
        {
            "likes_num": "555,876",
            "description": "I’m 25! A whole quarter century, man. I don’t wanna get too sappy but 24 was one of the most transformative years of my life and 25 is about to be my best. Without question. I know who I am, I know I am protected and guided, I know my purpose and I have regained my sense of self to a point of complete resilience. I’m so proud of myself for all of the growth that I have confronted this year, for all the challenges I have overcome that have made me stronger, for meeting myself with radical honesty and unapologetic presence. Thank you God, my ancestors, my angels, guides, family, friends and lovers & you all for witnessing me! I feel so much love in my heart and I’m grateful for another year of life❤️ HAPPY BIRTHDAY LO, UR A GODDESS✨💕",
            "img_url": "https://instagram.ftlv5-1.fna.fbcdn.net/v/t51.2885-15/e35/p1080x1080/208988058_335995337991161_4864422274708151532_n.jpg?_nc_ht=instagram.ftlv5-1.fna.fbcdn.net&_nc_cat=105&_nc_ohc=pSEZE3Np7vIAX_vg1BL&edm=AABBvjUBAAAA&ccb=7-4&oh=770b39acacffc3ebbd16dd090733d1fe&oe=60F94EC9&_nc_sid=83d603"
        }
    ]
}